[Config]
IDS_Language=Simp


[En]
IDS_Menu_Language = Language
IDS_Menu_About = Help

IDS_COMSTA = COM:
IDS_COMBTN = Open
IDS_Menu_Language_English = English
IDS_Menu_Language_SimpChinese = 简体中文
IDS_Menu_Language_TranChinese = 繁體中文
IDS_Static_Communication = Communication:

IDS_APP_Title = Calibration Monitoring
IDS_Menu_About_About = About platform

IDS_MONITOR_NTC = NTC Temperature Calibration
IDS_MONITOR_ACQUISITION_TEMP = Instrument Sampling Temperature:

IDS_MONITOR_TDS = TDS Calibration
IDS_MONITOR_TDS_CALIBRATION_MODE = Calibration Mode:
IDS_MONITOR_TDS_CALIBRATION_CHANNEL= Calibration Channel:
IDS_MONITOR_TDS_CALIBRATION_POS= Calibration Point:
IDS_MONITOR_TDS_CALIBRATION_HUMI= Calibration Concentration:

IDS_MONITOR_TIP = Tip Message

IDS_MONITOR_CH1 = CH1 Data
IDS_MONITOR_CH2 = CH2 Data

IDS_MONITOR_CONDUCTIVITY = Conductivity
IDS_MONITOR_TEMP = TEMP
IDS_MONITOR_TIME = TIME

ERR_FAILEDTOLOADDLL = failed to load 'HIDDLL.dll'
ERR_FAILEDTOLOADFUN = unable to get the function '%s' from Dll
ERR_DEVICENOTCONNECT = Device is not connected
ERR_FAILEDTOSENDCMD = Failed to send commands(%x). Please check whether the desired hardware is connected.
ERR_FAILEDTOGETACK = Failed to receive command(%x), check whether the hardware has been connected
ERR_ERRDATAFORMAT = Received data errors: frame header/tail errors
ERR_ERRCHECKSUM = Received data errors::checksum error
ERR_DATALEN = Received data errors::Data length error
ERR_ERRCMD = Received data errors::command type error
ERR_IICDATARATE = Failed to set IIC data rate
ERR_IICMODE = Failed to set IIC Mode
ERR_RECEVIDREND = Failed to set IIC ReceiverEnd
IDS_ERR_SP_OPEN         =       Failed to open '%s'
IDS_ERR_SP_INVALIDHANDLE = Invalid handle
IDS_ERR_SP_SETBUFFER    =  Failed to set the serial buffer 
IDS_ERR_SP_CLOSE        =  Failed to close serial port
IDS_ERR_SP_GETSTATE     =  Failed to get serial port status
IDS_ERR_SP_BAUDRATE     =  Failed to set baud rate
IDS_ERR_SP_INIT         =Failed to initialize serial port 
IDS_ERR_SP_CLEARINBUF   =Failed to clear input buffer
IDS_ERR_SP_CLEAROUTBUF  =Failed to clear output buffer
IDS_ERR_SP_FLUSH        =Failed to flush output buffer
IDS_ERR_SP_READ         =Failed to read serial port data
IDS_ERR_SP_RTIMEOUT     =Read serial port data time out
IDS_ERR_SP_WRITE        =Failed to wirte serial port data
IDS_ERR_SP_WTIMEOUT     =Write serial port data time out

TIP_OVERMONITOR = Channel %d monitoring ended
TIP_BEGINMONITORCH1 = Channel 1 monitoring started
TIP_BEGINMONITORCH2 = Channel 2 monitoring started
TIP_DEVICECONNECTED = TDS Display Board is connected
TIP_DEVICEUNCONNECTED = TDS Display Board has disconnected
TIP_READING = Reading device information...
TIP_DEVICEDISCONNECTED = the device has disconnected
TIP_FIRSTPOS = first point
TIP_CALONEPOS = single point calibration
TIP_CALOK = Calibrated 
TIP_UNCAL = Uncalibrated 
TIP_CALMODENOTONLY = Calibration Mode: Multi-point Calibration
TIP_CALMODEONLY = calibration mode: single-point calibration
TIP_CALPOSIDX = calibration point: point %d
TIP_CALCONC = calibration concentration: %.1f us/cm
TIP_CALTEMP = Calibration Temperature: %.1f ℃
TIP_TDSMODENOTHING = TDS Channel Mode: no 
TIP_TDSMODESIMPLECHANNEL = TDS channel mode: single channel 
TIP_TDSMODEDOUBLECHANNEL = TDS channel mode: double channel 
TIP_NTCMODENOTHING = NTC channel model: no 
TIP_NTCMODESIMPLECHANNEL = NTC channel mode: single channel 
TIP_NTCMODEDOUBLECHANNEL = NTC channel mode: double channel 

TIP_CHOICENTCCHANNEL = Please select a NTC channel
TIP_CHOICETDSCHANNEL = Please select a TDS channel
TIP_INPUTCONC = Please input the calibration concentration
TIP_INPUTTEMP = Please input the sampling temperature
TIP_INPUTCONCRANGE = Concentration Range:0-4000μm/cm
TIP_INPUTTEMPRANGE = TempRange:0-99℃

TIP_ERR = error
TIP_ERR_INPUTCHANELIDERR = nChanelID input parameter invalid
TIP_ERR_GETERRCHANEL = received the wrong channel
TIP_ERR_FAILGETDEVICEINFO = failed to get product information :%s
TIP_ERR_FAILGETTDSCH1INFO = failed to get TDSCH1 information :%s
TIP_ERR_FAILGETTDSCH2INFO = failed to get TDSCH2 info :%s
TIP_ERR_FAILGETNTCCH1INFO = failure to get NTCCH1 information :%s
TIP_ERR_FAILGETNTCCH2INFO = failure to get NTCCH2 information :%s
TIP_ERR_FAILNTCCAL = NTC calibration failure :%s
TIP_ERR_NTCOVERTIME = NTC calibration is failed: calibration time-out, NTC connection may be abnormal.
TIP_ERR_FAILTDSCAL = TDS calibration failure :%s
TIP_ERR_TDSOVERTIME = TDS calibration failure: calibration timeout

TIP_TDSTYPE = Probe Type:
IDS_TDSTIP = (Use KCL or NaCL solution for calibration)
IDS_NTCException = channe%d: NTC Access exception

IDS_NOFINDCOM = can not find the COM

IDS_CHART_TIP=Tip：Framing any area of the data window to zoom in, and double-click any position of the data window to restore the original size.

[Simp]
IDS_Menu_Language = 语言
IDS_Menu_About = 说明

IDS_COMSTA = 端口号:
IDS_COMBTN = 打开串口
IDS_Menu_Language_English = English
IDS_Menu_Language_SimpChinese = 简体中文
IDS_Menu_Language_TranChinese = 繁體中文
IDS_Static_Communication = 通讯方式:

IDS_Menu_About_About = 关于平台
IDS_APP_Title = 校准监测

IDS_MONITOR_NTC = NTC温度校准
IDS_MONITOR_ACQUISITION_TEMP = 仪器采集温度:

IDS_MONITOR_TDS = TDS校准
IDS_MONITOR_TDS_CALIBRATION_MODE = TDS校准模式:
IDS_MONITOR_TDS_CALIBRATION_CHANNEL= TDS校准通道:
IDS_MONITOR_TDS_CALIBRATION_POS= 校准点:
IDS_MONITOR_TDS_CALIBRATION_HUMI= 校准浓度:

IDS_MONITOR_TIP = 提示信息

IDS_MONITOR_CH1 = CH1数据
IDS_MONITOR_CH2 = CH2数据

IDS_MONITOR_CONDUCTIVITY = 电导率
IDS_MONITOR_TEMP = 温度
IDS_MONITOR_TIME = 时间

ERR_FAILEDTOLOADDLL = 无法加载'HIDDLL.dll'
ERR_FAILEDTOLOADFUN = 无法从dll获得函数'%s'的地址
ERR_DEVICENOTCONNECT = 没有连接硬件
ERR_FAILEDTOSENDCMD = 命令发送失败(%x),请检查是否有连接硬件
ERR_FAILEDTOGETACK = 接收数据失败(%x),请检查是否有连接硬件
ERR_ERRDATAFORMAT = 接收到的数据错误:帧头/帧尾错误
ERR_ERRCHECKSUM = 接收到的数据错误:Checksum校验失败
ERR_DATALEN = 接收到的数据错误:错误的数据长度
ERR_ERRCMD = 接收到的数据错误:错误的命令
ERR_IICDATARATE = 设置IIC数据率错误
ERR_IICMODE = 设置IIC模式失败
ERR_RECEVIDREND = 设置IIC应答信号失败
IDS_ERR_SP_OPEN  =       无法打开'%s'
IDS_ERR_SP_INVALIDHANDLE = 无效句柄
IDS_ERR_SP_SETBUFFER  =  无法设置串口缓冲区
IDS_ERR_SP_CLOSE      =  关闭串口失败
IDS_ERR_SP_GETSTATE   =  无法获取串口状态
IDS_ERR_SP_BAUDRATE   =  无法设置波特率
IDS_ERR_SP_INIT         = 初始化串口失败
IDS_ERR_SP_CLEARINBUF   = 无法清空输入缓冲区
IDS_ERR_SP_CLEAROUTBUF  = 无法清空输出缓冲区
IDS_ERR_SP_FLUSH        = 无法刷新输出缓冲区
IDS_ERR_SP_READ         = 读取串口数据失败
IDS_ERR_SP_RTIMEOUT     = 读取串口数据超时
IDS_ERR_SP_WRITE        = 发送串口数据失败
IDS_ERR_SP_WTIMEOUT     = 发送串口数据超时

TIP_OVERMONITOR = 通道%d结束监控
TIP_BEGINMONITORCH1 = 通道1开始监控
TIP_BEGINMONITORCH2 = 通道2开始监控
TIP_DEVICECONNECTED = 通用显示板已连接
TIP_DEVICEUNCONNECTED = 通用显示板未连接
TIP_READING = 正在读取设备信息...
TIP_DEVICEDISCONNECTED = 设备已断开
TIP_FIRSTPOS = 第一点
TIP_CALONEPOS = 单点校准
TIP_CALOK = 已校准
TIP_UNCAL = 未校准
TIP_CALMODENOTONLY = 校准模式: 多点校准
TIP_CALMODEONLY = 校准模式: 单点校准
TIP_CALPOSIDX = 校准点:     第%d点
TIP_CALCONC = 校准浓度: %.1f us/cm
TIP_CALTEMP = 校准温度: %.1f ℃
TIP_TDSMODENOTHING = TDS通道模式:无
TIP_TDSMODESIMPLECHANNEL = TDS通道模式:单通道
TIP_TDSMODEDOUBLECHANNEL = TDS通道模式:双通道
TIP_NTCMODENOTHING = NTC通道模式:无
TIP_NTCMODESIMPLECHANNEL = NTC通道模式:单通道
TIP_NTCMODEDOUBLECHANNEL = NTC通道模式:双通道

TIP_CHOICENTCCHANNEL = 请选择一个NTC通道
TIP_CHOICETDSCHANNEL = 请选择一个TDS通道
TIP_INPUTCONC = 请输入校准浓度
TIP_INPUTTEMP = 请输入采样温度
TIP_INPUTCONCRANGE = 浓度范围：0-4000μm/cm
TIP_INPUTTEMPRANGE = 温度范围:0-99℃

TIP_ERR = 错误提示
TIP_ERR_INPUTCHANELIDERR = nChanelID输入参数非法
TIP_ERR_GETERRCHANEL = 接收了错误的通道
TIP_ERR_FAILGETDEVICEINFO = 获取产品信息失败:%s
TIP_ERR_FAILGETTDSCH1INFO = 获取TDS CH1信息失败:%s
TIP_ERR_FAILGETTDSCH2INFO = 获取TDS CH2信息失败:%s
TIP_ERR_FAILGETNTCCH1INFO = 获取NTC CH1信息失败:%s
TIP_ERR_FAILGETNTCCH2INFO = 获取NTC CH2信息失败:%s
TIP_ERR_FAILNTCCAL = NTC校准失败:%s
TIP_ERR_NTCOVERTIME = NTC校准失败:校准超时,可能NTC接入异常
TIP_ERR_FAILTDSCAL = TDS校准失败:%s
TIP_ERR_TDSOVERTIME = TDS校准失败:校准超时
TIP_TDSTYPE = 探针类型:
IDS_TDSTIP = (校准溶液选用KCL或NaCL溶液)
IDS_NTCException = 通道%d: NTC接入异常

IDS_NOFINDCOM = 找不到COM口 

IDS_CHART_TIP=提示：框选数据窗口任意区域可放大，双击数据窗口任意位置还原原始大小。

[Tran]
IDS_Menu_Language = 語言
IDS_Menu_About = 說明

IDS_COMSTA = 端口號:
IDS_COMBTN = 打開串口
IDS_Menu_Language_English = English
IDS_Menu_Language_SimpChinese = 简体中文
IDS_Menu_Language_TranChinese = 繁體中文
IDS_Static_Communication = 通訊方式:


IDS_APP_Title = 校準監測
IDS_Menu_About_About = 關於平台

IDS_MONITOR_NTC = NTC溫度校準
IDS_MONITOR_ACQUISITION_TEMP = 儀器採集溫度:

IDS_MONITOR_TDS = TDS校準
IDS_MONITOR_TDS_CALIBRATION_MODE = TDS校準模式:
IDS_MONITOR_TDS_CALIBRATION_CHANNEL= TDS校準通道:
IDS_MONITOR_TDS_CALIBRATION_POS= 校準點:
IDS_MONITOR_TDS_CALIBRATION_HUMI= 校準濃度:

IDS_MONITOR_TIP = 提示信息

IDS_MONITOR_CH1 = CH1數據
IDS_MONITOR_CH2 = CH2數據

IDS_MONITOR_CONDUCTIVITY = 電導率
IDS_MONITOR_TEMP = 溫度
IDS_MONITOR_TIME = 時間

ERR_FAILEDTOLOADDLL = 無法載入'HIDDLL.dll'
ERR_FAILEDTOLOADFUN = 無法從dll獲得函數'%s'的地址
ERR_DEVICENOTCONNECT = 沒有連接硬體
ERR_FAILEDTOSENDCMD = 命令發送失敗(%x),請檢查是否有連接硬體
ERR_FAILEDTOGETACK = 接收資料失敗(%x),請檢查是否有連接硬體
ERR_ERRDATAFORMAT = 接收到的資料錯誤:幀頭/幀尾錯誤
ERR_ERRCHECKSUM = 接收到的資料錯誤:Checksum校驗失敗
ERR_DATALEN = 接收到的資料錯誤:錯誤的資料長度
ERR_ERRCMD = 接收到的資料錯誤:錯誤的命令
ERR_IICDATARATE = 設置IIC數據率錯誤
ERR_IICMODE = 設置IIC模式失敗
ERR_RECEVIDREND = 設置IIC應答信號失敗
IDS_ERR_SP_OPEN  =       無法打開'%s'
IDS_ERR_SP_INVALIDHANDLE = 無效句柄
IDS_ERR_SP_SETBUFFER  =  無法設置串口緩衝區
IDS_ERR_SP_CLOSE      =  關閉串口失敗
IDS_ERR_SP_GETSTATE   =  無法獲取串口狀態
IDS_ERR_SP_BAUDRATE   =  無法設置串口傳輸速率
IDS_ERR_SP_INIT         = 初始化串口失敗
IDS_ERR_SP_CLEARINBUF   = 無法清空輸入緩衝區
IDS_ERR_SP_CLEAROUTBUF  = 無法清空輸出緩衝區
IDS_ERR_SP_FLUSH        = 無法刷新輸出緩衝區
IDS_ERR_SP_READ         = 讀取串口數據失敗
IDS_ERR_SP_RTIMEOUT     = 讀取串口數據超時
IDS_ERR_SP_WRITE        = 發送串口資料失敗
IDS_ERR_SP_WTIMEOUT     = 發送串口資料超時

TIP_OVERMONITOR = 通道%d結束監控
TIP_BEGINMONITORCH1 = 通道1開始監控
TIP_BEGINMONITORCH2 = 通道2開始監控
TIP_DEVICECONNECTED = 通用顯示板已連接
TIP_DEVICEUNCONNECTED = 通用顯示板未連接
TIP_READING = 正在讀取設備信息...
TIP_DEVICEDISCONNECTED = 設備已斷開
TIP_FIRSTPOS = 第一點
TIP_CALONEPOS = 單點校準
TIP_CALOK = 已校準
TIP_UNCAL = 未校準
TIP_CALMODENOTONLY = 校準模式: 多點校準
TIP_CALMODEONLY = 校準模式: 單點校準
TIP_CALPOSIDX = 校準點:     第%d點
TIP_CALCONC = 校準濃度: %.1f us/cm
TIP_CALTEMP = 校準溫度: %.1f ℃
TIP_TDSMODENOTHING = TDS通道模式:無
TIP_TDSMODESIMPLECHANNEL = TDS通道模式:單通道
TIP_TDSMODEDOUBLECHANNEL = TDS通道模式:雙通道
TIP_NTCMODENOTHING = NTC通道模式:無
TIP_NTCMODESIMPLECHANNEL = NTC通道模式:單通道
TIP_NTCMODEDOUBLECHANNEL = NTC通道模式:雙通道

TIP_CHOICENTCCHANNEL = 請選擇一個NTC通道
TIP_CHOICETDSCHANNEL = 請選擇一個TDS通道
TIP_INPUTCONC = 請輸入校準濃度
TIP_INPUTTEMP = 請輸入採樣溫度
TIP_INPUTCONCRANGE = 濃度範圍：0-4000μm/cm
TIP_INPUTTEMPRANGE = 溫度範圍:0-99℃

TIP_ERR = 錯誤提示
TIP_ERR_INPUTCHANELIDERR = nChanelID輸入參數非法
TIP_ERR_GETERRCHANEL = 接收了錯誤的通道
TIP_ERR_FAILGETDEVICEINFO = 獲取產品信息失敗:%s
TIP_ERR_FAILGETTDSCH1INFO = 獲取TDS CH1信息失敗:%s
TIP_ERR_FAILGETTDSCH2INFO = 獲取TDS CH2信息失敗:%s
TIP_ERR_FAILGETNTCCH1INFO = 獲取NTC CH1信息失敗:%s
TIP_ERR_FAILGETNTCCH2INFO = 獲取NTC CH2信息失敗:%s
TIP_ERR_FAILNTCCAL = NTC校準失敗:%s
TIP_ERR_NTCOVERTIME = NTC校準失敗:校準超時,可能NTC接入異常
TIP_ERR_FAILTDSCAL = TDS校準失敗:%s
TIP_ERR_TDSOVERTIME = TDS校準失敗:校準超時
TIP_TDSTYPE = 探針類型:
IDS_TDSTIP = (校準溶液選用KCL或NaCL溶液)
IDS_NTCException = 通道%d: NTC接入異常

IDS_NOFINDCOM  = 找不到COM口

IDS_CHART_TIP=提示：框選數據窗口任意區域可放大，雙擊數據窗口任意位置還原原始大小。